#include "SmartM_M0.h"
#include "74ls164.h"

								
/****************************************
*函数名称:LS164Init
*输    入:无
*输    出:无
*功    能:74LS164初始化
******************************************/
VOID LS164Init(VOID)
{
   P0_PMD &= ~(3UL<<(LS164_DATA_PIN<<1));//IO模式控制,P0.4
   P0_PMD &= ~(3UL<<(LS164_CLK_PIN <<1));

	 P0_PMD |= 1UL<<(LS164_DATA_PIN<<1);//IO模式，P0.4设置为输出模式
	 P0_PMD |= 1UL<<(LS164_CLK_PIN <<1);//IO模式，P0.5设置为输出模式
}


/****************************************
*函数名称:LS164Send
*输    入:byte 单个字节
*输    出:无
*功    能:74LS164发送单个字节
******************************************/
VOID LS164Send_B2(UINT8 d)
{
   UINT8 i;
   for(i=0; i<=7; i++)
   {
		 if(d & (1<<(7-i)))
     {
			 LS164_DATA(1);
	   }
		 else
		 {
	     LS164_DATA(0);
		 }

     LS164_CLK(0); 
     LS164_CLK(1); 
   }
}
